[{"id":1,"title":"Joe Rogan Experience #1278 - Kevin Hart","description":"The \"Joe Rogan Experience #1278 - Kevin Hart\" episode is a lively and engaging conversation between two of the biggest names in comedy.\\n\\nIn the episode, Kevin Hart opens up about his rise to fame, discussing his early struggles as a comedian and the challenges he faced breaking into the entertainment industry.\\n\\nThe conversation covers a wide range of topics, from Hart's approach to comedy and his creative process, to his experiences working on blockbuster films like \"Jumanji\" and \"Central Intelligence\".\\n\\nHart also discusses his personal life, including his family and his recent car accident that left him with serious injuries.\\n\\nThroughout the episode, Hart's infectious energy and humor keep the conversation moving, making it an enjoyable listen for fans of both Joe Rogan and Kevin Hart.","publishedAt":null,"url":null,"podcastId":5,"bestEpisode":1,"episodeNumber":1278,"featuredEpisode":null,"mostStreamedEpisode":null,"episodeCoverImage":null},{"id":2,"title":"Joe Rogan Experience #1080 - David Goggins","description":"The \"Joe Rogan Experience #1080 - David Goggins\" episode was significant to many people due to the inspiring and transformative message delivered by the guest, David Goggins.\\n\\nDavid Goggins is a retired Navy SEAL and accomplished ultramarathon runner, who has overcome numerous obstacles in his life, including childhood abuse, obesity, and health issues. In the episode, Goggins discusses his life story and shares his unique perspective on motivation, discipline, and resilience.\\n\\nThroughout the podcast, Goggins emphasizes the importance of pushing past mental barriers and challenging oneself to achieve greatness. He advocates for a \"can't hurt me\" mindset, in which individuals take ownership of their lives and refuse to be limited by fear or doubt.\\n\\nGoggins also touches on the power of accountability and the benefits of embracing discomfort. He believes that true growth and progress can only occur when individuals are willing to step outside of their comfort zones and confront their weaknesses.\\n\\nThe episode has resonated with many individuals who are seeking to overcome personal challenges and reach their full potential. Goggins' message of perseverance and self-discipline has inspired countless individuals to push past their limits and pursue their goals with relentless determination.","publishedAt":null,"url":null,"podcastId":5,"bestEpisode":1,"episodeNumber":1080,"featuredEpisode":null,"mostStreamedEpisode":null,"episodeCoverImage":null},{"id":3,"title":"Sean Kelly: Existentialism, Nihilism, and the Search for Meaning | Lex Fridman Podcast","description":"Sean Kelly: Existentialism, Nihilism, and the Search for Meaning | Lex Fridman Podcast","publishedAt":null,"url":null,"podcastId":7,"bestEpisode":1,"episodeNumber":null,"featuredEpisode":null,"mostStreamedEpisode":null,"episodeCoverImage":null},{"id":4,"title":"Dr. Robert Sapolsky: Science of Stress, Testosterone & Free Will | Huberman Lab Podcast #35","description":"The \"Dr. Robert Sapolsky: Science of Stress, Testosterone & Free Will | Huberman Lab Podcast #35\" is a fascinating discussion between neuroendocrinologist and primatologist Dr. Robert Sapolsky and host Dr. Andrew Huberman.\\n\\nIn the episode, Sapolsky delves into the science of stress, exploring how stress affects the body and brain at a cellular level. He also discusses the role of cortisol and testosterone in stress responses and their impact on health and behavior.\\n\\nThe conversation then turns to the topic of free will, as Sapolsky explores the complex interplay between genetics, environment, and individual choice. He provides insights into the latest research on the neuroscience of decision-making and the factors that influence our actions.\\n\\nThroughout the episode, Sapolsky's engaging storytelling and deep knowledge of the subject matter make for a thought-provoking and informative listen. The episode is recommended for anyone interested in the science of stress, hormones, and decision-making.","publishedAt":null,"url":null,"podcastId":1,"bestEpisode":1,"episodeNumber":35,"featuredEpisode":null,"mostStreamedEpisode":null,"episodeCoverImage":null},{"id":5,"title":"Dr. Matthew Walker on Sleep for Enhancing Learning, Creativity, Immunity, and Glymphatic System","description":"In this episode, Rhonda Patrick interviews sleep expert Dr. Matthew Walker about the many benefits of sleep for brain function, physical health, and disease prevention.","publishedAt":null,"url":null,"podcastId":4,"bestEpisode":1,"episodeNumber":null,"featuredEpisode":null,"mostStreamedEpisode":null,"episodeCoverImage":null},{"id":6,"title":"Dr. Satchin Panda on Circadian Insights Into Cancer, Alzheimer's, and Cardiovascular Disease","description":"Dr. Satchin Panda is a leading expert on the circadian rhythm and its effects on health. In this episode, he and Rhonda discuss the importance of aligning our daily routines with our body's natural rhythms.","publishedAt":null,"url":null,"podcastId":4,"bestEpisode":null,"episodeNumber":null,"featuredEpisode":null,"mostStreamedEpisode":null,"episodeCoverImage":null},{"id":7,"title":"Dr. David Sabatini on the Science of Rapamycin and mTOR for Health and Lifespan","description":"Dr. David Sabatini is a researcher at MIT and a pioneer in the field of mTOR biology, which has implications for aging and disease. In this episode, he and Rhonda discuss the latest research on mTOR and its potential applications for health and longevity.","publishedAt":null,"url":null,"podcastId":4,"bestEpisode":null,"episodeNumber":null,"featuredEpisode":null,"mostStreamedEpisode":null,"episodeCoverImage":null},{"id":8,"title":"Dr. Guido Kroemer on Autophagy, Caloric Restriction Mimetics, Fasting & Protein Acetylation","description":"Dr. Guido Kroemer is a professor of biology at the University of Paris and a leading expert on autophagy, a cellular process that has been linked to disease prevention and longevity. In this episode, he and Rhonda discuss the latest research on autophagy and its potential health benefits.","publishedAt":null,"url":null,"podcastId":4,"bestEpisode":null,"episodeNumber":null,"featuredEpisode":null,"mostStreamedEpisode":null,"episodeCoverImage":null},{"id":9,"title":"Dr. Jed Fahey on the Amazing Science of Isothiocyanates and Sulforaphane","description":"Dr. Jed Fahey is a researcher at Johns Hopkins University and an expert on isothiocyanates, a group of compounds found in cruciferous vegetables like broccoli and cauliflower. In this episode, he and Rhonda discuss the many health benefits of these compounds and how to maximize their effects through diet and supplementation.","publishedAt":null,"url":null,"podcastId":4,"bestEpisode":null,"episodeNumber":null,"featuredEpisode":null,"mostStreamedEpisode":null,"episodeCoverImage":null},{"id":10,"title":"Dr. Peter Attia: Fasting, Autophagy, and Bulletproof Coffee","description":"A fascinating discussion between neuroscientist Dr. Andrew Huberman and physician Dr. Peter Attia.\\n\\nIn the episode, Huberman delves into the science of sleep, exploring the importance of circadian rhythms and the ways in which sleep affects the body and brain. He also discusses the benefits and potential risks of various sleep supplements and strategies for improving sleep quality.\\n\\nThe conversation then turns to the topic of recovery, as Attia and Huberman discuss the latest research on the most effective ways to recover from physical activity and injury. They touch on the benefits of fasting and other dietary interventions for promoting recovery and overall health.\\n\\nThroughout the episode, Huberman and Attia share their deep knowledge and insights on the subject matter, making for a thought-provoking and informative listen. The \"Dr. Andrew Huberman: Neuroscience of Sleep, Supplements, and Recovery | Peter Attia Drive #13\" episode is recommended for anyone interested in learning more about the science of sleep, recovery, and optimal health.","publishedAt":null,"url":null,"podcastId":1,"bestEpisode":null,"episodeNumber":null,"featuredEpisode":null,"mostStreamedEpisode":null,"episodeCoverImage":null},{"id":11,"title":"Sleep Hygiene, Chronotypes, and Hormones: Tips for Better Sleep","description":"This episode offers practical tips and advice for improving your sleep quality and quantity, including how to establish a regular sleep schedule and optimize your sleep environment.","publishedAt":null,"url":null,"podcastId":1,"bestEpisode":null,"episodeNumber":null,"featuredEpisode":null,"mostStreamedEpisode":null,"episodeCoverImage":null},{"id":12,"title":"Mental Toughness, Resilience, and Overcoming Fear","description":"In this episode, Andrew Huberman discusses the science of mental toughness and resilience, and offers practical strategies for overcoming fear and anxiety.","publishedAt":null,"url":null,"podcastId":1,"bestEpisode":null,"episodeNumber":null,"featuredEpisode":null,"mostStreamedEpisode":null,"episodeCoverImage":null},{"id":13,"title":"Optimizing Brain Health and Performance","description":"This episode covers a wide range of topics related to brain health and performance, including the role of nutrition, exercise, and stress management in optimizing cognitive function.","publishedAt":null,"url":null,"podcastId":1,"bestEpisode":null,"episodeNumber":null,"featuredEpisode":null,"mostStreamedEpisode":null,"episodeCoverImage":null},{"id":14,"title":"Understanding Anxiety: Science and Solutions","description":"This episode offers a deep dive into the science of anxiety, including the neurological and physiological mechanisms that underlie it, and practical strategies for managing and overcoming anxiety.","publishedAt":null,"url":null,"podcastId":1,"bestEpisode":null,"episodeNumber":null,"featuredEpisode":null,"mostStreamedEpisode":null,"episodeCoverImage":null},{"id":15,"title":"Brené Brown: The Power of Vulnerability","description":"In this episode, Jay Shetty interviews Brené Brown, a researcher and author who is well-known for her work on vulnerability, shame, and courage.","publishedAt":null,"url":null,"podcastId":21,"bestEpisode":null,"episodeNumber":null,"featuredEpisode":null,"mostStreamedEpisode":null,"episodeCoverImage":null},{"id":16,"title":"Jay Shetty: How to Think Like a Monk","description":"In this episode, Jay shares his own personal story of transformation and offers insights and advice for cultivating a monk-like mindset in everyday life.","publishedAt":null,"url":null,"podcastId":21,"bestEpisode":null,"episodeNumber":null,"featuredEpisode":null,"mostStreamedEpisode":null,"episodeCoverImage":null},{"id":17,"title":"Deepak Chopra: The Nature of Consciousness","description":"In this episode, Jay Shetty interviews Deepak Chopra, a renowned spiritual teacher and author, about the nature of consciousness and the power of meditation.","publishedAt":null,"url":null,"podcastId":21,"bestEpisode":null,"episodeNumber":null,"featuredEpisode":null,"mostStreamedEpisode":null,"episodeCoverImage":null},{"id":18,"title":"How to Get a Guy to Like You","description":"Alex and Sofia offer tips and advice for women who are looking to attract and keep the interest of a potential partner.","publishedAt":null,"url":null,"podcastId":2,"bestEpisode":null,"episodeNumber":null,"featuredEpisode":null,"mostStreamedEpisode":null,"episodeCoverImage":null},{"id":19,"title":"The Walk of Shame","description":"This episode delves into the often-misunderstood experience of the \"walk of shame,\" and offers advice for women who are navigating this situation.","publishedAt":null,"url":null,"podcastId":2,"bestEpisode":null,"episodeNumber":null,"featuredEpisode":null,"mostStreamedEpisode":null,"episodeCoverImage":null},{"id":20,"title":"The Daddy Gang on Anxiety and Mental Health","description":"Alex and Sofia discuss their own experiences with anxiety and mental health, and offer tips and resources for coping with these issues.","publishedAt":null,"url":null,"podcastId":2,"bestEpisode":null,"episodeNumber":null,"featuredEpisode":null,"mostStreamedEpisode":null,"episodeCoverImage":null},{"id":21,"title":"The Great Crypto Debate","description":"In this episode, the hosts discuss the pros and cons of cryptocurrencies such as Bitcoin, Ethereum, and Dogecoin, and debate whether they are a good investment opportunity or a risky bubble.","publishedAt":null,"url":null,"podcastId":3,"bestEpisode":null,"episodeNumber":null,"featuredEpisode":null,"mostStreamedEpisode":null,"episodeCoverImage":null},{"id":22,"title":"The Future of Work","description":"This episode explores the changing nature of work and the workplace in the wake of the COVID-19 pandemic, and offers insights and predictions for how work will continue to evolve in the future.","publishedAt":null,"url":null,"podcastId":3,"bestEpisode":null,"episodeNumber":null,"featuredEpisode":null,"mostStreamedEpisode":null,"episodeCoverImage":null},{"id":23,"title":"The Future of Media and Content","description":"In this episode, the hosts discuss the rapidly changing landscape of media and content creation, and offer their perspectives on how these industries will continue to evolve in the coming years.","publishedAt":null,"url":null,"podcastId":3,"bestEpisode":null,"episodeNumber":null,"featuredEpisode":null,"mostStreamedEpisode":null,"episodeCoverImage":null}]